vizualjack/bl602_rgb_controller/customer_app/custom_app/custom_app/main.c
    /*Display Banner*/
    if (0 == bl_chip_banner(&banner)) {
        puts(banner);
    }
    puts("\r\n");
    /*Chip Feature list*/
    puts("\r\n");
    puts("------------------------------------------------------------\r\n");
    puts("RISC-V Core Feature:");
    bl_chip_info(chip_feature);
    puts(chip_feature);
    puts("\r\n");

    puts("Build Version: ");
    puts(BL_SDK_VER); // @suppress("Symbol is not resolved")
    puts("\r\n");

    puts("PHY   Version: ");
    puts(BL_SDK_PHY_VER); // @suppress("Symbol is not resolved")
    puts("\r\n");

    puts("RF    Version: ");
    puts(BL_SDK_RF_VER); // @suppress("Symbol is not resolved")
    puts("\r\n");

    puts("Build Date: ");
    puts(__DATE__);
    puts("\r\n");

    puts("Build Time: ");
    puts(__TIME__);
    puts("\r\n");
    puts("------------------------------------------------------------\r\n");

}

static void system_init(void)
{
    blog_init();
    bl_irq_init();
    bl_sec_init();
    bl_sec_test();
    bl_dma_init();
    hal_boot2_init();

    /* board config is set after system is init*/
    hal_board_cfg(0);
}

static void system_thread_init()
{
    /*nothing here*/
}

// ///////// CUSTOM CODE HERE
// // Static HTML page content
// const char *html_page =
//     "<html><head><title>BL602 HTTP Server</title></head>"
//     "<body><h1>Hello, World!</h1><p>This is a simple HTTP server running on BL602!</p></body></html>";

// // HTTP handler for the root page
// err_t httpd_handler(struct netconn *conn) {
//     struct netbuf *inbuf;
//     char *buf;
//     u16_t buflen;

//     // Receive HTTP request
//     if (netconn_recv(conn, &inbuf) == ERR_OK) {
//         netbuf_data(inbuf, (void **)&buf, &buflen);
//         printf("HTTP Request: %s\n", buf);

//         // Send HTTP response
//         const char *response =
//             "HTTP/1.1 200 OK\r\n"
//             "Content-Type: text/html\r\n"
//             "Connection: close\r\n\r\n";
//         netconn_write(conn, response, strlen(response), NETCONN_COPY);
//         netconn_write(conn, html_page, strlen(html_page), NETCONN_COPY);
//     }

//     // Close and delete the connection
//     netconn_close(conn);
//     netbuf_delete(inbuf);

//     return ERR_OK;
// }


// // Start the HTTP server
// void http_server_start(void) {
//     struct netconn *conn, *newconn;

//     // Create a new TCP connection
//     conn = netconn_new(NETCONN_TCP);
//     netconn_bind(conn, IP_ADDR_ANY, 80);
//     netconn_listen(conn);

//     puts("HTTP server listening on port 80...\n");

//     while (1) {
//         // Accept new connections
//         if (netconn_accept(conn, &newconn) == ERR_OK) {
//             httpd_handler(newconn);
//             netconn_delete(newconn);
//         }
//     }
// }
// ////////////////////////////////////////////////////////////////

int timeout = 1000;
bool ap_started = false;
static void custom_task_func(void *pvParameters) {
    vTaskDelay(1000);

    while (1) {
        if (ap_started) {
            // puts("Starting http server...\r\n");
            // http_server_start();
            break;
        }
        if(!ap_started && finished_init) {
            puts("Starting ap...");
            wifi_mgmr_ap_start(wifi_mgmr_ap_enable(), "Test this", 0, NULL, 1);
            // puts("Init lwip...");
            // lwip_init();
            ap_started = true;
            break;
        }
        vTaskDelay(3000);
    }
    puts("Custom task end");
    vTaskDelete(NULL);

}

void bfl_main()
{
    static StackType_t aos_loop_proc_stack[1024];
    static StaticTask_t aos_loop_proc_task;
    // static StackType_t proc_hellow_stack[512];
    // static StaticTask_t proc_hellow_task;
    static StackType_t custom_task_stack[512];
    static StaticTask_t custom_task;

    // time_main = bl_timer_now_us();
    // /*Init UART In the first place*/
    bl_uart_init(0, 16, 7, 255, 255, 2 * 1000 * 1000);
    puts("Starting bl602 now....\r\n");

    _dump_boot_info();

    vPortDefineHeapRegions(xHeapRegions);
    printf("Heap %u@%p, %u@%p\r\n",
            (unsigned int)&_heap_size, &_heap_start,
            (unsigned int)&_heap_wifi_size, &_heap_wifi_start
    );
    printf("Boot2 consumed %lums\r\n", time_main / 1000);

    system_init();
    system_thread_init();

    // puts("[OS] Added proc_hellow_entry task\r\n");
    // xTaskCreateStatic(proc_hellow_entry, (char*)"hellow", 512, NULL, 15, proc_hellow_stack, &proc_hellow_task);
    puts("[OS] Added aos_loop_proc task\r\n");
    xTaskCreateStatic(aos_loop_proc, (char*)"event_loop", 1024, NULL, 15, aos_loop_proc_stack, &aos_loop_proc_task);
    puts("[OS] Added custom task\r\n");
    xTaskCreateStatic(custom_task_func, (char*)"custom_task", 512, NULL, 15, custom_task_stack, &custom_task);
    puts("[OS] Starting TCP/IP Stack...\r\n");
    tcpip_init(NULL, NULL);

    puts("[OS] Starting OS Scheduler...\r\n");
    vTaskStartScheduler();
}
